stephdust/Flow.IO/lib/ESP32_Flasher/src/esp32_flasher.cpp
#include "esp32_flasher.h"

/**
   Calculate timeout based on data size
   @param size_bytes: Size of data in bytes
   @param time_per_mb: Time allowance per megabyte
   Returns: Calculated timeout value
*/
static uint32_t timeout_per_mb(uint32_t size_bytes, uint32_t time_per_mb) {
  constexpr uint32_t kMb = 1000000UL;
  uint32_t timeout = (uint32_t)(((uint64_t)time_per_mb * (uint64_t)size_bytes + (kMb - 1U)) / kMb);
  timeout = MAX(timeout, DEFAULT_FLASH_TIMEOUT);
  timeout += 2000U;  // safety margin for slow targets/busy bus
  return timeout;
}

/**
   Calculate checksum for data verification
   @param data: Pointer to data buffer
   @param size: Size of data
   Returns: Calculated checksum
*/
static uint8_t compute_checksum(const uint8_t *data, uint32_t size) {
  uint8_t checksum = 0xEF;  // Initial value
  while (size--) {
    checksum ^= *data++;
  }
  return checksum;
}

void ESP32Flasher::setUpdateProgressCallback(THandlerFunction value){
	_updateProgressCallback = value;
}

/**
   Verify and process response from ESP32
   @param command: Expected command to verify against
   Returns: SUCCESS or error code
*/
int ESP32Flasher::verifyResponse(uint8_t command) {
  lastCommandFailCode_ = RESPONSE_OK;
  uint8_t ch;
  uint8_t buff[8];  // Response buffer: direction(1) + command(1) + size(2) + value(4)
  // Searching for start delimiter
  do {
    // Step 1: Find start delimiter
    do {
      int32_t remaining = (s_time_end - millis());
      if (remaining <= 0) {
        remaining = 0; // Timeout approaching while waiting for delimiter
      }
      Serial2.setTimeout(remaining);

      int read = Serial2.readBytes(&ch, 1);
      if (read < 0) {
        // Read operation failed
        return ERR_FAIL;
      } else if (read < 1) {
        // Timeout waiting for start delimiter
        return ERR_TIMEOUT;
      }
    } while (ch != DELIMITER);

    // Step 2: Skip any extra delimiters
    do {
      int32_t remaining = (s_time_end - millis());
      if (remaining <= 0) {
        remaining = 0;
      }
      Serial2.setTimeout(remaining);

      int read = Serial2.readBytes(&ch, 1);
      if (read < 0) {
        do { Serial.print("[ERROR] Failed reading extra delimiters"); Serial.print("\r\n"); } while (0);
        return ERR_FAIL;
      } else if (read < 1) {
        do { Serial.print("[ERROR] Timeout reading extra delimiters"); Serial.print("\r\n"); } while (0);
        return ERR_TIMEOUT;
      }
    } while (ch == DELIMITER);

    // Store first byte (already read)
    buff[0] = ch;

    // Step 3: Read response packet
    for (uint32_t i = 1; i < 8; i++) {
      int32_t remaining = (s_time_end - millis());
      if (remaining <= 0) {
        remaining = 0;
      }
      Serial2.setTimeout(remaining);

      int read = Serial2.readBytes(&ch, 1);
      if (read < 0) {
        Serial.printf("[ERROR] Failed reading byte %d of response\n", i);
        return ERR_FAIL;
      } else if (read < 1) {
        Serial.printf("[ERROR] Timeout reading byte %d of response\n", i);
        return ERR_TIMEOUT;
      }

      // Handle SLIP encoding
      if (ch == 0xDB) {
        remaining = (s_time_end - millis());
        if (remaining <= 0) {
          remaining = 0;
        }
        Serial2.setTimeout(remaining);

        read = Serial2.readBytes(&ch, 1);
        if (read < 0) {
          do { Serial.print("[ERROR] Failed reading SLIP escape sequence"); Serial.print("\r\n"); } while (0);
          return ERR_FAIL;
        } else if (read < 1) {
          do { Serial.print("[ERROR] Timeout reading SLIP escape sequence"); Serial.print("\r\n"); } while (0);
          return ERR_TIMEOUT;
        }

        if (ch == 0xDC) {
          buff[i] = 0xC0;
        } else if (ch == 0xDD) {
          buff[i] = 0xDB;
        } else {
          do { Serial.print("[ERROR] Invalid SLIP escape sequence"); Serial.print("\r\n"); } while (0);
          return ERR_INVALID_RESP;
        }
      } else if (ch == DELIMITER) {
        break;
      } else {
        buff[i] = ch;
      }
    }

    // Step 4: Read status bytes
    uint8_t status[2];  // [0] = failed flag, [1] = error code
    for (uint32_t i = 0; i < 2; i++) {
      int32_t remaining = (s_time_end - millis());
      if (remaining <= 0) {
        remaining = 0;
      }
      Serial2.setTimeout(remaining);

      int read = Serial2.readBytes(&ch, 1);
      if (read < 0) {
        Serial.printf("[ERROR] Failed reading status byte %d\n", i);
        return ERR_FAIL;
      } else if (read < 1) {
        Serial.printf("[ERROR] Timeout reading status byte %d\n", i);
        return ERR_TIMEOUT;
      }

      // Handle SLIP encoding for status
      if (ch == 0xDB) {
        remaining = (s_time_end - millis());
        if (remaining <= 0) {
          remaining = 0;
        }
        Serial2.setTimeout(remaining);

        read = Serial2.readBytes(&ch, 1);
        if (read < 0) {
          do { Serial.print("[ERROR] Failed reading status SLIP escape"); Serial.print("\r\n"); } while (0);
          return ERR_FAIL;
        } else if (read < 1) {
          do { Serial.print("[ERROR] Timeout reading status SLIP escape"); Serial.print("\r\n"); } while (0);
          return ERR_TIMEOUT;
        }

        if (ch == 0xDC) {
          status[i] = 0xC0;
        } else if (ch == 0xDD) {
          status[i] = 0xDB;
        } else {
          do { Serial.print("[ERROR] Invalid status SLIP escape sequence"); Serial.print("\r\n"); } while (0);
          return ERR_INVALID_RESP;
        }
      } else {
        status[i] = ch;
      }
    }

    // Step 5: Wait for end delimiter
    do {
      int32_t remaining = (s_time_end - millis());
      if (remaining <= 0) {
        remaining = 0;
      }
      Serial2.setTimeout(remaining);

      int read = Serial2.readBytes(&ch, 1);
      if (read < 0) {
        do { Serial.print("[ERROR] Failed reading end delimiter"); Serial.print("\r\n"); } while (0);
        return ERR_FAIL;
      } else if (read < 1) {
        do { Serial.print("[ERROR] Timeout waiting for end delimiter"); Serial.print("\r\n"); } while (0);
        return ERR_TIMEOUT;
      }
    } while (ch != DELIMITER);

    // Step 6: Verify response matches expected command
    if (buff[0] == READ_DIRECTION && buff[1] == command) {
      // Check status
      if (status[0]) {  // If failed flag is set
        lastCommandFailCode_ = status[1];
        do { Serial.print("[ERROR] Command failed with status:"); Serial.print("\r\n"); } while (0);
        switch (status[1]) {  // error code
          case INVALID_CRC:
            do { Serial.print("  INVALID_CRC: Checksum verification failed"); Serial.print("\r\n"); } while (0);
            break;
          case INVALID_COMMAND:
            do { Serial.print("  INVALID_COMMAND: Command or parameters invalid"); Serial.print("\r\n"); } while (0);
            break;
          case COMMAND_FAILED:
            do { Serial.print("  COMMAND_FAILED: Failed to execute command"); Serial.print("\r\n"); } while (0);
            break;
          case FLASH_WRITE_ERR:
            do { Serial.print("  FLASH_WRITE_ERR: Flash write verification failed"); Serial.print("\r\n"); } while (0);
            break;
          case FLASH_READ_ERR:
            do { Serial.print("  FLASH_READ_ERR: Flash read operation failed"); Serial.print("\r\n"); } while (0);
            break;
          case READ_LENGTH_ERR:
            do { Serial.print("  READ_LENGTH_ERR: Read length exceeds limit"); Serial.print("\r\n"); } while (0);
            break;
          case DEFLATE_ERROR:
            do { Serial.print("  DEFLATE_ERROR: Decompression error"); Serial.print("\r\n"); } while (0);
            break;
          default:
            Serial.printf("  UNKNOWN ERROR: Code 0x%02X\n", status[1]);
            break;
        }
        return ERR_CMD_STATUS;
      }
      // Command response verified successfully
      return SUCCESS;
    }
    do { Serial.print("[DEBUG] Response didn't match expected command, continuing..."); Serial.print("\r\n"); } while (0);
  } while (1);
}

void ESP32Flasher::flushUartInput_(uint32_t drainMs)
{
  const uint32_t start = millis();
  while ((uint32_t)(millis() - start) < drainMs) {
    while (Serial2.available() > 0) {
      (void)Serial2.read();
    }
    delay(1);
  }
}

int ESP32Flasher::recoverBootloaderLink_(uint32_t syncTimeoutMs)
{
  flushUartInput_(40U);
  const uint32_t previousTimeout = s_time_end;
  s_time_end = millis() + syncTimeoutMs;
  const int syncStatus = espSyncHandle();
  if (syncStatus != SUCCESS) {
    s_time_end = previousTimeout;
    return syncStatus;
  }

  s_time_end = millis() + DEFAULT_TIMEOUT;
  const int attachStatus = spiAttachCmd(0);
  s_time_end = previousTimeout;
  return attachStatus;
}

/**
   Send flash begin command to ESP32
   @param offset: Flash offset address
   @param erase_size: Size of region to erase
   @param block_size: Size of each block
   @param blocks_to_write: Number of blocks to write
   Returns: SUCCESS or error code
*/
int ESP32Flasher::flashBeginCmd(uint32_t offset,
                                uint32_t erase_size,
                                uint32_t block_size,
                                uint32_t blocks_to_write) {
  do { Serial.print("[INFO] ========== Sending Flash Begin Command =========="); Serial.print("\r\n"); } while (0);

  // Command packet structure (24 bytes total)
  uint8_t cmd_data[24] = {0};

  // Fill header (8 bytes)
  cmd_data[0] = WRITE_DIRECTION;    // direction
  cmd_data[1] = FLASH_BEGIN;        // command
  cmd_data[2] = 0x10;               // size (16 bytes payload)
  cmd_data[3] = 0x00;               // size high byte
  cmd_data[4] = 0x00;               // checksum placeholder
  cmd_data[5] = 0x00;               // checksum placeholder
  cmd_data[6] = 0x00;               // checksum placeholder
  cmd_data[7] = 0x00;               // checksum placeholder

