stephdust/Flow.IO/lib/ESP32_Flasher/src/esp32_flasher.cpp
  // Fill payload (16 bytes)
  memcpy(&cmd_data[8], &erase_size, 4);       // erase_size
  memcpy(&cmd_data[12], &blocks_to_write, 4); // packet_count
  memcpy(&cmd_data[16], &block_size, 4);      // packet_size
  memcpy(&cmd_data[20], &offset, 4);          // offset

  // Reset sequence number for new flash operation
  s_sequence_number = 0;

  //  Serial.println("[DEBUG] Flash begin parameters:");
  //  Serial.printf("  - Offset: 0x%X\n", offset);
  //  Serial.printf("  - Erase size: %d bytes\n", erase_size);
  //  Serial.printf("  - Block size: %d bytes\n", block_size);
  //  Serial.printf("  - Blocks to write: %d\n", blocks_to_write);

  // Send start delimiter
  Serial2.write(DELIMITER);

  // Send command data with SLIP encoding
  for (uint32_t i = 0; i < 24; i++) {
    if (cmd_data[i] == 0xC0) {
      Serial2.write((const char *)C0_REPLACEMENT, 2);
    } else if (cmd_data[i] == 0xDB) {
      Serial2.write((const char *)DB_REPLACEMENT, 2);
    } else {
      Serial2.write((const char *)&cmd_data[i], 1);
    }
  }

  // Send end delimiter
  Serial2.write(DELIMITER);

  // Verify response
  int response = verifyResponse(FLASH_BEGIN);
  if (response == SUCCESS) {
    do { Serial.print("[INFO] Flash begin command accepted"); Serial.print("\r\n"); } while (0);
  } else {
    Serial.printf("[ERROR] Flash begin command failed with error: %d\n", response);
  }

  do { Serial.print("================================================\n"); Serial.print("\r\n"); } while (0);
  return response;
}

/**
   Send flash data command with payload to ESP32
   @param data: Pointer to data buffer
   @param size: Size of data to flash
   Returns: SUCCESS or error code
*/
int ESP32Flasher::flashDataCmd(const uint8_t *data, uint32_t size) {

  // Command header (24 bytes total)
  uint8_t cmd_data[24] = {0};

  // Fill header (4 bytes)
  cmd_data[0] = WRITE_DIRECTION;  // Direction
  cmd_data[1] = FLASH_DATA;       // Command
  cmd_data[2] = 0x10;             // Size low byte
  cmd_data[3] = 0x04;             // Size high byte

  // Calculate and fill checksum (4 bytes)
  uint8_t checksum = compute_checksum(data, size);
  cmd_data[4] = checksum;
  cmd_data[5] = 0x00;
  cmd_data[6] = 0x00;
  cmd_data[7] = 0x00;

  // Fill data size (4 bytes)
  cmd_data[8] = 0x00;
  cmd_data[9] = 0x04;
  cmd_data[10] = 0x00;
  cmd_data[11] = 0x00;

  // Fill sequence number (4 bytes)
  cmd_data[12] = s_sequence_number & 0xFF;
  cmd_data[13] = (s_sequence_number >> 8) & 0xFF;
  cmd_data[14] = 0x00;
  cmd_data[15] = 0x00;

  // Increment sequence number for next packet
  s_sequence_number++;

  // Send start delimiter
  Serial2.write(DELIMITER);

  // Send header with SLIP encoding
  for (uint32_t i = 0; i < 24; i++) {
    if (cmd_data[i] == 0xC0) {
      Serial2.write((const char *)C0_REPLACEMENT, 2);
    } else if (cmd_data[i] == 0xDB) {
      Serial2.write((const char *)DB_REPLACEMENT, 2);
    } else {
      Serial2.write((const char *)&cmd_data[i], 1);
    }
  }

  // Send data with SLIP encoding
  for (uint32_t i = 0; i < size; i++) {
    if (data[i] == 0xC0) {
      Serial2.write((const char *)C0_REPLACEMENT, 2);
    } else if (data[i] == 0xDB) {
      Serial2.write((const char *)DB_REPLACEMENT, 2);
    } else {
      Serial2.write((const char *)&data[i], 1);
    }
  }

  // Send end delimiter
  Serial2.write(DELIMITER);

  // Verify response
  int response = verifyResponse(FLASH_DATA);
  if (response != SUCCESS) {
    Serial.printf("[ERROR] Flash data command failed with error: %d\n", response);
  }
  
  return response;
}

/**
   Send flash end command
   @param stay_in_loader: true to remain in bootloader, false to reboot app
   Returns: SUCCESS or error code
*/
int ESP32Flasher::flashEndCmd(bool stay_in_loader) {
  uint8_t cmd_data[12] = {0};
  cmd_data[0] = WRITE_DIRECTION;
  cmd_data[1] = FLASH_END;
  cmd_data[2] = 4;
  cmd_data[3] = 0;
  const uint32_t payload = stay_in_loader ? 1U : 0U;
  memcpy(&cmd_data[8], &payload, sizeof(payload));

  Serial2.write(DELIMITER);
  for (uint32_t i = 0; i < sizeof(cmd_data); i++) {
    if (cmd_data[i] == 0xC0) {
      Serial2.write((const char *)C0_REPLACEMENT, 2);
    } else if (cmd_data[i] == 0xDB) {
      Serial2.write((const char *)DB_REPLACEMENT, 2);
    } else {
      Serial2.write((const char *)&cmd_data[i], 1);
    }
  }
  Serial2.write(DELIMITER);

  return verifyResponse(FLASH_END);
}

/**
   Handle ESP32 synchronization
   Returns: SUCCESS or error code
*/
int ESP32Flasher::espSyncHandle(void) {
  do { Serial.print("\n[INFO] ========== Starting ESP32 Sync =========="); Serial.print("\r\n"); } while (0);

  // Command structure (40 bytes total: 4 header + 36 sync sequence)
  uint8_t cmd_data[40] = {0};

  // Fill header
  cmd_data[0] = WRITE_DIRECTION;
  cmd_data[1] = SYNC;
  cmd_data[2] = 36;  // Size of sync sequence
  cmd_data[3] = 0;   // Checksum

  // Fill sync sequence
  cmd_data[4] = 0x07;
  cmd_data[5] = 0x07;
  cmd_data[6] = 0x12;
  cmd_data[7] = 0x20;

  // Fill remaining bytes with 0x55 (sync pattern)
  for (int i = 8; i < 40; i++) {
    cmd_data[i] = 0x55;
  }

  do { Serial.print("[DEBUG] Sending sync sequence..."); Serial.print("\r\n"); } while (0);

  // Send start delimiter
  Serial2.write(DELIMITER);

  // Send sync command with SLIP encoding
  for (uint32_t i = 0; i < 40; i++) {
    if (cmd_data[i] == 0xC0) {
      Serial2.write((const char *)C0_REPLACEMENT, 2);
    } else if (cmd_data[i] == 0xDB) {
      Serial2.write((const char *)DB_REPLACEMENT, 2);
    } else {
      Serial2.write((const char *)&cmd_data[i], 1);
    }
  }

  // Send end delimiter
  Serial2.write(DELIMITER);

  // Verify response
  int response = verifyResponse(SYNC);
  if (response == SUCCESS) {
    do { Serial.print("[INFO] Sync successful"); Serial.print("\r\n"); } while (0);
  } else {
    Serial.printf("[ERROR] Sync failed with error: %d\n", response);
  }

  do { Serial.print("================================================\n"); Serial.print("\r\n"); } while (0);
  return response;
}



/**
   Attach SPI flash
   @param config: SPI configuration
   Returns: SUCCESS or error code
*/
int ESP32Flasher::spiAttachCmd(uint32_t config) {
  do { Serial.print("\n[INFO] ========== Attaching SPI Flash =========="); Serial.print("\r\n"); } while (0);

  // Command structure (12 bytes total)
  uint8_t cmd_data[12] = {0};

  // Fill command data
  cmd_data[0] = WRITE_DIRECTION;
  cmd_data[1] = SPI_ATTACH;
  cmd_data[2] = 8;  // Size of payload (config + zeros)
  cmd_data[3] = 0;  // Checksum

  // Copy configuration
  memcpy(&cmd_data[4], &config, 4);
  // Last 4 bytes remain zero

