stephdust/Flow.IO/lib/ESP32_Flasher/src/esp32_flasher.cpp
  // Send start delimiter
  Serial2.write(DELIMITER);

  // Send command with SLIP encoding
  for (uint32_t i = 0; i < 12; i++) {
    if (cmd_data[i] == 0xC0) {
      Serial2.write((const char *)C0_REPLACEMENT, 2);
    } else if (cmd_data[i] == 0xDB) {
      Serial2.write((const char *)DB_REPLACEMENT, 2);
    } else {
      Serial2.write((const char *)&cmd_data[i], 1);
    }
  }

  // Send end delimiter
  Serial2.write(DELIMITER);

  // Verify response
  int response = verifyResponse(SPI_ATTACH);
  if (response == SUCCESS) {
    do { Serial.print("[INFO] SPI flash attached successfully"); Serial.print("\r\n"); } while (0);
  } else {
    Serial.printf("[ERROR] SPI flash attachment failed with error: %d\n", response);
  }

  do { Serial.print("================================================\n"); Serial.print("\r\n"); } while (0);
  return response;
}

/**
   Establish connection with ESP32 and prepare for flashing
   Returns: true if connection successful, false otherwise
*/
int ESP32Flasher::espConnect(void) {
  do { Serial.print("\n[INFO] ========== Starting ESP32 Connection =========="); Serial.print("\r\n"); } while (0);
  int32_t trials = MAX_TRIALS;
  int get_sync_status;

  // Put ESP32 into download mode sequence
  do { Serial.print("[DEBUG] Initiating download mode sequence..."); Serial.print("\r\n"); } while (0);

  // Step 1: Assert BOOT pin
  digitalWrite(bootPin_, LOW);
  do { Serial.print("[DEBUG] BOOT pin set LOW - enabling download mode"); Serial.print("\r\n"); } while (0);
  delay(50);

  // Step 2: Reset sequence
  digitalWrite(enablePin_, LOW);
  do { Serial.print("[DEBUG] EN pin set LOW - starting reset"); Serial.print("\r\n"); } while (0);
  delay(100);
  digitalWrite(enablePin_, HIGH);
  do { Serial.print("[DEBUG] EN pin set HIGH - completing reset"); Serial.print("\r\n"); } while (0);
  delay(50);

  // Step 3: Release BOOT pin
  digitalWrite(bootPin_, HIGH);
  do { Serial.print("[DEBUG] BOOT pin set HIGH - ready for sync"); Serial.print("\r\n"); } while (0);

  // Attempt synchronization with timeout and retry
  do {
    Serial.printf("[INFO] Sync attempt %d of %d\n", (MAX_TRIALS - trials + 1), MAX_TRIALS);
    s_time_end = millis() + SYNC_TIMEOUT;

    get_sync_status = espSyncHandle();
    if (get_sync_status == ERR_TIMEOUT) {
      Serial.printf("[WARN] Sync timeout on attempt %d\n", (MAX_TRIALS - trials + 1));
      if (--trials == 0) {
        do { Serial.print("[ERROR] All sync attempts failed - connection failed"); Serial.print("\r\n"); } while (0);
        return ERR_TIMEOUT;
      }
      delay(100);
    } else if (get_sync_status != SUCCESS) {
      Serial.printf("[ERROR] Sync failed with error code: %d\n", get_sync_status);
      return get_sync_status;
    }
  } while (get_sync_status != SUCCESS);

  do { Serial.print("[INFO] ESP32 sync successful!"); Serial.print("\r\n"); } while (0);

  // Attach SPI flash
  do { Serial.print("[DEBUG] Attaching SPI flash..."); Serial.print("\r\n"); } while (0);
  s_time_end = millis() + DEFAULT_TIMEOUT;
  get_sync_status = spiAttachCmd(0);

  if (get_sync_status == SUCCESS) {
    do { Serial.print("[INFO] SPI flash attached successfully"); Serial.print("\r\n"); } while (0);
    do { Serial.print("============================================\n"); Serial.print("\r\n"); } while (0);
    return SUCCESS;
  } else {
    Serial.printf("[ERROR] SPI flash attachment failed with code: %d\n", get_sync_status);
    do { Serial.print("============================================\n"); Serial.print("\r\n"); } while (0);
    return get_sync_status;
  }
}

/**
   Initialize flash process
   @param flash_address: Starting address for flash operation
   @param image_size: Size of image to flash
   @param block_size: Size of each block to write
   Returns: SUCCESS or error code
*/
int ESP32Flasher::espFlashStart(uint32_t flash_address, uint32_t image_size, uint32_t block_size) {
  do { Serial.print("[INFO] ========== Initializing Flash Process =========="); Serial.print("\r\n"); } while (0);

  // Validate image size
  if (image_size > ESP_FLASH_MAX_SIZE) {
    Serial.printf("[ERROR] Image size %lu exceeds maximum flash size %lu\n",
                  (unsigned long)image_size, (unsigned long)ESP_FLASH_MAX_SIZE);
    return ERR_IMG_SIZE;
  }

  // Calculate number of blocks and erase size
  uint32_t blocks_to_write = (image_size + block_size - 1) / block_size;
  uint32_t erase_size = block_size * blocks_to_write;
  s_flash_write_size = block_size;

  // Calculate timeout based on erase size
  uint32_t timeout = timeout_per_mb(erase_size, ERASE_REGION_TIMEOUT_PER_MB);
  s_time_end = millis() + timeout;
  
  Serial.printf("[DEBUG] Flash timeout set to: %lu ms\n", (unsigned long)timeout);
  
  // Initialize flash operation
  int result = flashBeginCmd(flash_address, erase_size, block_size, blocks_to_write);

  if (result == SUCCESS) {
    do { Serial.print("[INFO] Flash initialization successful"); Serial.print("\r\n"); } while (0);
  } else {
    Serial.printf("[ERROR] Flash initialization failed with error: %d\n", result);
  }

  do { Serial.print("================================================\n"); Serial.print("\r\n"); } while (0);
  return result;
}
/**
   Write data to ESP32 flash
   @param payload: Data to write
   @param size: Size of data
   Returns: SUCCESS or error code
*/
int ESP32Flasher::espFlashWrite(void *payload, uint32_t size) {

  // Calculate padding required
  uint32_t padding_bytes = s_flash_write_size - size;
  uint8_t *data = (uint8_t *)payload;
  uint32_t padding_index = size;

  // Add padding if necessary
  if (padding_bytes > 0) {
    while (padding_bytes--) {
      data[padding_index++] = PADDING_PATTERN;
    }
  }

  // Set timeout for FLASH_DATA response (write + flash latency).
  s_time_end = millis() + FLASH_DATA_TIMEOUT;

  // Write data to flash
  int result = flashDataCmd(data, s_flash_write_size);
  return result;
}

/**
   Initialize the ESP32 Flasher
   - Sets up serial communication
   - Configures control pins
   - Prepares for flashing operations
*/
void ESP32Flasher::espFlasherInit(void) {
  do { Serial.print("\n[INFO] ========== ESP32 Flasher Initialization =========="); Serial.print("\r\n"); } while (0);

