stephdust/Flow.IO/lib/ESP32_Flasher/src/esp32_flasher.cpp
  // Initialize serial communication with ESP32
  Serial2.begin(115200);
  do { Serial.print("[DEBUG] Serial2 communication initialized at 115200 baud"); Serial.print("\r\n"); } while (0);

  // Configure control pins
  pinMode(bootPin_, OUTPUT);    // Boot mode control
  pinMode(enablePin_, OUTPUT);  // Reset control

  do { Serial.print("[DEBUG] Control pins configured:"); Serial.print("\r\n"); } while (0);
  Serial.printf("  - BOOT_PIN: %d\n", bootPin_);
  Serial.printf("  - EN_PIN: %d\n", enablePin_);

  do { Serial.print("[INFO] ESP32 Flasher initialization complete"); Serial.print("\r\n"); } while (0);
  do { Serial.print("================================================\n"); Serial.print("\r\n"); } while (0);
}

/**
   Flash a binary stream to the ESP32
   @param myFile: Name of data stream
*/
int ESP32Flasher::espFlashBinStream(Stream &myFile, uint32_t size)  // Flash binary file
{
  do { Serial.print("\n[INFO] ========== Starting Binary Stream Flash Process =========="); Serial.print("\r\n"); } while (0);
  do { Serial.print("[WARN] Do not interrupt the flashing process!"); Serial.print("\r\n"); } while (0);
  Serial.printf("[INFO] Attempting to flash stream\n");

  const int flashStatus = flashBinaryStream(myFile, size, ESP_FLASH_OFFSET);
  if (flashStatus != SUCCESS) {
    Serial.printf("[ERROR] Stream flash failed with error: %d\n", flashStatus);
    do { Serial.print("================================================\n"); Serial.print("\r\n"); } while (0);
    return flashStatus;
  }

  const int endStatus = epsFlashFinish(false);
  if (endStatus != SUCCESS) {
    Serial.printf("[ERROR] Flash end command failed with error: %d\n", endStatus);
    do { Serial.print("================================================\n"); Serial.print("\r\n"); } while (0);
    return endStatus;
  }

  // Reset ESP32 after a clean FLASH_END.
  do { Serial.print("[INFO] Flash completed, resetting ESP32..."); Serial.print("\r\n"); } while (0);
  digitalWrite(enablePin_, LOW);
  delay(100);
  digitalWrite(enablePin_, HIGH);

  do { Serial.print("================================================\n"); Serial.print("\r\n"); } while (0);
  return SUCCESS;
}

/**
   Flash a binary file to the ESP32
   @param bin_file_name: Name of binary file in SPIFFS
*/
/*void ESP32Flasher::espFlashBinFile(const char* bin_file_name) {
  do { Serial.print("\n[INFO] ========== Starting Binary File Flash Process =========="); Serial.print("\r\n"); } while (0);
  do { Serial.print("[WARN] Do not interrupt the flashing process!"); Serial.print("\r\n"); } while (0);
  Serial.printf("[INFO] Attempting to flash file: %s\n", bin_file_name);

  if (SPIFFS.exists(bin_file_name)) {
    File file_read = SPIFFS.open(bin_file_name, FILE_READ);
    size_t size = file_read.size();

    Serial.printf("[INFO] File found, size: %d bytes\n", size);

    if (size <= ESP_FLASH_MAX_SIZE) {
      do { Serial.print("[INFO] File size within valid range"); Serial.print("\r\n"); } while (0);
      flashBinary(file_read, size, ESP_FLASH_OFFSET);
    } else {
      Serial.printf("[ERROR] File size %d exceeds maximum flash size %d\n",
                    size, ESP_FLASH_MAX_SIZE);
    }
    file_read.close();
  } else {
    Serial.printf("[ERROR] File %s not found in SPIFFS\n", bin_file_name);
  }

  // Reset ESP32
  do { Serial.print("[INFO] Resetting ESP32..."); Serial.print("\r\n"); } while (0);
  digitalWrite(enablePin_, LOW);
  delay(100);
  digitalWrite(enablePin_, HIGH);

  do { Serial.print("================================================\n"); Serial.print("\r\n"); } while (0);
}*/

/**
   Flash a binary Stream to ESP32
   @param file: Reference to the binary file to flash
   @param address: Flash address to write to
   Returns: SUCCESS or error code
*/
int ESP32Flasher::flashBinaryStream(Stream &myFile, uint32_t size, uint32_t address)
{
  //uint8_t payload[256];  // Buffer for flash data chunks
  uint8_t payload[1024] = { 0 };  // Buffer for flash data chunks
 // Serial.println("\n[INFO] ========== Starting Binary Flash Process ==========");
 // Serial.printf("[INFO] File size: %d bytes\n", size);
  //Serial.printf("[INFO] Flash address: 0x%X\n", address);

  // Step 1: Initialize flash process
  //Serial.println("[INFO] Erasing flash (this may take a while)...");
  int flash_start_status = espFlashStart(address, size, sizeof(payload));
  if (flash_start_status != SUCCESS) {
     Serial.printf("[ERROR] Flash erase failed with error: %d\n", flash_start_status);
    return flash_start_status;
  }

  // Step 2: Program flash
 // Serial.println("[INFO] Starting programming sequence");
  //size_t binary_size = size;
  //size_t written = 0;
  //int previousProgress = -1;

  const uint32_t total_size = size;
  uint32_t remaining = size;
  uint32_t streamIdleSince = millis();
  uint32_t lastWaitLogMs = streamIdleSince;
  uint32_t lastProgressLogMs = streamIdleSince;
  uint32_t lastProgressLoggedBytes = 0;
  myFile.setTimeout(250);

  Serial.printf("[INFO] Stream writer started: total=%lu block=%u stall_timeout=%u ms\n",
                (unsigned long)total_size,
                (unsigned)sizeof(payload),
                (unsigned)STREAM_STALL_TIMEOUT);

  // Write data in chunks
  while (remaining > 0) {
    const uint32_t chunkCap = sizeof(payload);
    uint32_t toRead = chunkCap;
    if (toRead > remaining) toRead = remaining;

    // Read directly from stream; do not gate on available() to avoid false stalls.
    int c = myFile.readBytes(payload, toRead);
    if (c <= 0) {
      const uint32_t nowMs = millis();
      const uint32_t idleMs = (uint32_t)(nowMs - streamIdleSince);
      const int availNow = myFile.available();
      const uint32_t written = total_size - remaining;
      if ((uint32_t)(nowMs - lastWaitLogMs) >= 5000U) {
        Serial.printf("[DEBUG] Waiting stream data... written=%lu remaining=%lu idle=%lu ms avail=%d\n",
                      (unsigned long)written,
                      (unsigned long)remaining,
                      (unsigned long)idleMs,
                      availNow);
        lastWaitLogMs = nowMs;
      }
      if (idleMs > STREAM_STALL_TIMEOUT) {
        const uint32_t elapsedMs = (uint32_t)(nowMs - lastProgressLogMs);
        Serial.printf("[ERROR] Stream read timeout at offset=%lu (remaining=%lu idle=%lu elapsed=%lu avail=%d)\n",
                      (unsigned long)written,
                      (unsigned long)remaining,
                      (unsigned long)idleMs,
                      (unsigned long)elapsedMs,
                      availNow);
        return ERR_TIMEOUT;
      }
      delay(2);
      continue;
    }
    streamIdleSince = millis();
    lastWaitLogMs = streamIdleSince;


    // Calculate chunk size
    //   size_t to_read = MIN(size, sizeof(payload));

