stephdust/Flow.IO/lib/ESP32_Flasher/src/esp32_flasher.cpp
    // Read chunk from file
    //   myFile.readBytes(payload, to_read);

    // Write chunk to flash
    flash_start_status = espFlashWrite(payload, c);
    if (flash_start_status != SUCCESS) {
      const uint32_t written = total_size - remaining;
        Serial.printf("[ERROR] Flash write failed at offset=%lu chunk=%d err=%d\n",
                      (unsigned long)written,
                      c,
                      flash_start_status);
        return flash_start_status;
    }
    // Update progress
    //size -= to_read;
    //written += to_read;

    // Display progress
    //int progress = (int)(((float)written / binary_size) * 100);
    //if (previousProgress != progress) {
    // previousProgress = progress;
       //Serial.printf("[INFO] Programming progress: %d%% (%d/%d)\n", progress,written,binary_size);  
      //Callback function called at every new percent done
    if (_updateProgressCallback) _updateProgressCallback();
    remaining -= (uint32_t)c;
    const uint32_t written = total_size - remaining;
    const uint32_t nowMs = millis();
    if ((written - lastProgressLoggedBytes) >= (32U * 1024U) || remaining == 0 ||
        (uint32_t)(nowMs - lastProgressLogMs) >= 5000U) {
      const uint32_t elapsedMs = (uint32_t)(nowMs - lastProgressLogMs);
      const uint32_t rate = (elapsedMs > 0U) ? (uint32_t)(((uint64_t)(written - lastProgressLoggedBytes) * 1000ULL) / elapsedMs) : 0U;
      Serial.printf("[DEBUG] Stream progress: written=%lu/%lu (%.1f%%) rate=%lu B/s\n",
                    (unsigned long)written,
                    (unsigned long)total_size,
                    total_size > 0 ? (100.0f * (float)written / (float)total_size) : 0.0f,
                    (unsigned long)rate);
      lastProgressLogMs = nowMs;
      lastProgressLoggedBytes = written;
    }
    delay(1);
  }

//  Serial.println("[INFO] Programming complete!");
//  Serial.println("================================================\n");
  return SUCCESS;
}

/**
   Flash a binary file to ESP32
   @param file: Reference to the binary file to flash
   @param size: Size of the binary file
   @param address: Flash address to write to
   Returns: SUCCESS or error code
*/
/*
int ESP32Flasher::flashBinary(File& file, uint32_t size, uint32_t address) {
  uint8_t payload[1024];  // Buffer for flash data chunks

  do { Serial.print("\n[INFO] ========== Starting Binary Flash Process =========="); Serial.print("\r\n"); } while (0);
  Serial.printf("[INFO] File size: %d bytes\n", size);
  Serial.printf("[INFO] Flash address: 0x%X\n", address);

  // Step 1: Initialize flash process
  do { Serial.print("[INFO] Erasing flash (this may take a while)..."); Serial.print("\r\n"); } while (0);
  int flash_start_status = espFlashStart(address, size, sizeof(payload));
  if (flash_start_status != SUCCESS) {
    Serial.printf("[ERROR] Flash erase failed with error: %d\n", flash_start_status);
    return flash_start_status;
  }

  // Step 2: Program flash
  do { Serial.print("[INFO] Starting programming sequence"); Serial.print("\r\n"); } while (0);
  size_t binary_size = size;
  size_t written = 0;
  int previousProgress = -1;

  // Write data in chunks
  while (size > 0) {
    // Calculate chunk size
    size_t to_read = MIN(size, sizeof(payload));

    // Read chunk from file
    file.read(payload, to_read);

    // Write chunk to flash
    flash_start_status = espFlashWrite(payload, to_read);
    if (flash_start_status != SUCCESS) {
      Serial.printf("[ERROR] Flash write failed at offset 0x%X with error: %d\n",
                    written, flash_start_status);
      return flash_start_status;
    }

    // Update progress
    size -= to_read;
    written += to_read;

    // Display progress
    int progress = (int)(((float)written / binary_size) * 100);
    if (previousProgress != progress) {
      previousProgress = progress;
      Serial.printf("[INFO] Programming progress: %d%%\n", progress);
    }
  }

  do { Serial.print("[INFO] Programming complete!"); Serial.print("\r\n"); } while (0);
  do { Serial.print("================================================\n"); Serial.print("\r\n"); } while (0);
  return SUCCESS;
}*/

int ESP32Flasher::epsFlashFinish(bool reboot)
{
  int result = ERR_FAIL;
  const bool primaryStayInLoader = !reboot;
  for (int attempt = 1; attempt <= FLASH_END_RETRIES; ++attempt) {
    flushUartInput_(25U);
    s_time_end = millis() + FLASH_END_TIMEOUT;
    result = flashEndCmd(primaryStayInLoader);
    if (result == SUCCESS) {
      if (attempt > 1) {
        Serial.printf("[INFO] FLASH_END recovered on retry %d/%d\n", attempt, FLASH_END_RETRIES);
      }
      return SUCCESS;
    }

    Serial.printf("[WARN] FLASH_END failed attempt %d/%d (err=%d boot_status=0x%02X)\n",
                  attempt,
                  FLASH_END_RETRIES,
                  result,
                  (unsigned)lastCommandFailCode_);
    if (attempt < FLASH_END_RETRIES) {
      const int recoverStatus = recoverBootloaderLink_(2000U);
      if (recoverStatus == SUCCESS) {
        Serial.printf("[INFO] Bootloader link recovered before FLASH_END retry %d\n", attempt + 1);
      } else {
        Serial.printf("[WARN] Bootloader recover failed before retry %d (err=%d)\n", attempt + 1, recoverStatus);
      }
      delay(120);
    }
  }

  if (primaryStayInLoader) {
    Serial.print("[WARN] FLASH_END stay-in-loader variant failed, trying reboot variant\r\n");
    (void)recoverBootloaderLink_(2500U);
    flushUartInput_(30U);
    s_time_end = millis() + FLASH_END_TIMEOUT;
    result = flashEndCmd(false);
    if (result == SUCCESS) {
      Serial.print("[INFO] FLASH_END reboot variant succeeded\r\n");
      return SUCCESS;
    }
    Serial.printf("[WARN] FLASH_END reboot variant failed (err=%d boot_status=0x%02X)\n",
                  result,
                  (unsigned)lastCommandFailCode_);
  }

  return result;
}
